PRIORITIES = {
    "(": -1,
    "+": 0,
    "-": 0,
    "*": 1,
    "/": 1,
    "%": 1,
    "u-": 2,
    "u+": 2,
    "^": 3,
}

BINARY_OPERATORS = ("+", "-", "*", "^", "/", "%")
UNARY_OPERATORS = ("u-", "u+")

NUMBER_PAT = r"0|[1-9]+[0-9]*|[0-9]+\.[0-9]*|\.[0-9]+"

WRONG_PAT = r"[0-9\.\)][\(]|[\)][0-9\.\(]|[\+\-\*%^\/][\)]|[\(][\*%^\/]|\(\)"

VALID_CHARS = "u0123456789.+-*^%/()"

TYPE_CONVERT = {  # разделим на классы для удобства валидации
    "mm": "l",
    "cm": "l",
    "m": "l",
    "km": "l",
    "g": "m",
    "kg": "m",
    "c": "t",
    "k": "t",
    "f": "t",
}

TYPE_L_COEF = (
    {  # коэф-ты для перевода всего в мм и обратно, написать в readme, что всё переводим сначала в мм, потом в другую
        "mm": 1,
        "cm": 10,
        "m": 1000,
        "km": 1000000,
    }
)

TYPE_M_COEF = {"g": 1, "kg": 1000}
